using System.Collections;
using System.Collections.Generic;
using UnityEngine;

/// <summary>
/// Контейнер с приказами высланными командирам полков
/// Вешается на адьютанта, а потом передается офицеру
/// Эту штуку выплевывает офицер группы или части
/// </summary>
public class reg_command  {
	/// Приоритет приказа

	/// Ограничен ли по времени

	/// Флаг - отсчитываем по времени с момента создания приказа или когда он добрался до полка 

	/// Время создания приказа

	/// Время получения приказа

	/// Если есть - точка к которой двигаться

	/// Указание на состояние боевой готовности
	 
	/// Авторитет офицера, выдавшего приказ

	/// Номер офицера, выдавшего приказ

	/// Указание на обычно не используемый скрипт 

}
