using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public static class FuncV {

	/// <summary>
	/// 	/// </summary>
	/// <param name="number">Номер полка для которого считаем</param>
	static public void RebildVeiw (int number)
	{
		// Разная дистанция в клетках для разных положений полка по высоте, то есть если на холме, то обзор дальше. Если ниже среднего - то полк внизу и у него потенцальный обзор меньше
	
		// Чертим линиии видимости от первой линии полка к границам других полков
		// Если ширина первой линии меньше 40, то считаем от граничных
		// Если линия больше 40, то считаем каждые 20 солдат. Если 

		/// если хотя бы один рейкаст кинулся, то его видно

	}

}
